In [3]:
import pandas as pd
df=pd.read_csv("new_data.csv")
df

   SN    Name  Age  add
0   1     Ram   20  Ktm
1   2   Shyam   19  Pkr
2   3    Rita   25  Bkt
3   4    Gita   22  Bkt
4   5  Babita   18  Ktm
5   6    Sita   30  Pkr

In [2]:
# !pip install pandas      <-- instal pandas in jupyter

In [13]:
df=pd.read_csv("new_data.csv", nrows=4)
df

   SN   Name  Age  add
0   1    Ram   20  Ktm
1   2  Shyam   19  Pkr
2   3   Rita   25  Bkt
3   4   Gita   22  Bkt

In [6]:
df.head(4)

   SN   Name  Age  add
0   1    Ram   20  Ktm
1   2  Shyam   19  Pkr
2   3   Rita   25  Bkt
3   4   Gita   22  Bkt

In [9]:
df.tail(3)

   SN   Name  Age  add
1   2  Shyam   19  Pkr
2   3   Rita   25  Bkt
3   4   Gita   22  Bkt

In [14]:
df=pd.read_csv("new_data.csv",index_col="SN")   # 0 = SN as ad[0] is SN
df

      Name  Age  add
SN
1      Ram   20  Ktm
2    Shyam   19  Pkr
3     Rita   25  Bkt
4     Gita   22  Bkt
5   Babita   18  Ktm
6     Sita   30  Pkr

In [20]:
df=pd.read_csv("new_data.csv",index_col="SN",usecols=["SN","Name","Age","add"])
df

      Name  Age  add
SN
1      Ram   20  Ktm
2    Shyam   19  Pkr
3     Rita   25  Bkt
4     Gita   22  Bkt
5   Babita   18  Ktm
6     Sita   30  Pkr

In [21]:
#iloc  (based on iloc)
df.iloc[1:5]

      Name  Age  add
SN
2    Shyam   19  Pkr
3     Rita   25  Bkt
4     Gita   22  Bkt
5   Babita   18  Ktm

In [23]:
df.iloc[1:4,0:2]

     Name  Age
SN
2   Shyam   19
3    Rita   25
4    Gita   22

In [24]:
df

      Name  Age  add
SN
1      Ram   20  Ktm
2    Shyam   19  Pkr
3     Rita   25  Bkt
4     Gita   22  Bkt
5   Babita   18  Ktm
6     Sita   30  Pkr

In [26]:
#loc   (based on value)
df=pd.read_csv("new_data.csv",index_col="SN")
df.loc[2:5]

      Name  Age  add
SN
2    Shyam   19  Pkr
3     Rita   25  Bkt
4     Gita   22  Bkt
5   Babita   18  Ktm

In [27]:
df=pd.read_csv("new_data.csv",index_col="SN")
df["Name"]

SN
1       Ram
2     Shyam
3      Rita
4      Gita
5    Babita
6      Sita
Name: Name, dtype: object

In [28]:
df["Name"]=="Ram"

SN
1     True
2    False
3    False
4    False
5    False
6    False
Name: Name, dtype: bool

In [29]:
df[df["Name"]=="Ram"]

   Name  Age  add
SN
1   Ram   20  Ktm

In [31]:
df[df["Age"]>=20]

    Name  Age  add
SN
1    Ram   20  Ktm
3   Rita   25  Bkt
4   Gita   22  Bkt
6   Sita   30  Pkr

In [4]:
df

   SN    Name  Age  add
0   1     Ram   20  Ktm
1   2   Shyam   19  Pkr
2   3    Rita   25  Bkt
3   4    Gita   22  Bkt
4   5  Babita   18  Ktm
5   6    Sita   30  Pkr

In [7]:
df[(df["Age"]>15) & (df["add"]=="Ktm")]

   SN    Name  Age  add
0   1     Ram   20  Ktm
4   5  Babita   18  Ktm

In [8]:
df.values

array([[1, 'Ram', 20, 'Ktm'],
       [2, 'Shyam', 19, 'Pkr'],
       [3, 'Rita', 25, 'Bkt'],
       [4, 'Gita', 22, 'Bkt'],
       [5, 'Babita', 18, 'Ktm'],
       [6, 'Sita', 30, 'Pkr']], dtype=object)

In [9]:
df.items

<bound method DataFrame.items of    SN    Name  Age  add
0   1     Ram   20  Ktm
1   2   Shyam   19  Pkr
2   3    Rita   25  Bkt
3   4    Gita   22  Bkt
4   5  Babita   18  Ktm
5   6    Sita   30  Pkr>

In [10]:
df.columns

Index(['SN', 'Name', 'Age', 'add'], dtype='object')

In [12]:
list(df.columns)

['SN', 'Name', 'Age', 'add']

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   SN      6 non-null      int64
 1   Name    6 non-null      object
 2   Age     6 non-null      int64
 3   add     6 non-null      object
dtypes: int64(2), object(2)
memory usage: 324.0+ bytes

In [17]:
#data entry into csv file using list inside dict
import pandas as pd
data={"name":["Ram","Shaym","Hari"],
     "age":[34,56,76],
      "add":["Ktm","Bkt","Lal"]}
df=pd.DataFrame(data)
df.to_json("info.json")   #save in specified file
df

    name  age  add
0    Ram   34  Ktm
1  Shaym   56  Bkt
2   Hari   76  Lal

In [20]:
df=pd.read_json("info.json")
df

    name  age  add
0    Ram   34  Ktm
1  Shaym   56  Bkt
2   Hari   76  Lal

In [22]:
import csv
data=[["name","age","add"],
      ["Ram",34,"Ktm"],
     ["Shyam",56],"Bkt",
     ["Hari",78,"Lal"]]

file=open("data.csv","w")    # <- object - it holds the process
x=csv.writer(file)
x.writerows(data)
file.close()

In [24]:
import csv
list_data=[]
file=open("data.csv")   #default is read
data=csv.DictReader(file)
for i in data:
    list_data.append(i)
    
list_data

[{'name': 'Ram', 'age': '34', 'add': 'Ktm'},
 {'name': 'Shyam', 'age': '56', 'add': None},
 {'name': 'B', 'age': 'k', 'add': 't'},
 {'name': 'Hari', 'age': '78', 'add': 'Lal'}]

In [27]:
import csv
csv_columns=["Name","Age","Address"]
dict=[
    {"Name":"Aayush","Age":23,"Address":"Ktm"},
    {"Name":"Shyam","Age":33,"Address":"Btm"}
]

csvfile=open("data.csv","w")
writer=csv.DictWriter(csvfile, fieldnames=csv_columns)

writer.writeheader()

writer.writerows(dict)

csvfile.close()

In [31]:
import pandas as pd
df1=pd.DataFrame({"name":["Ram","Shaym","Hari"],
     "age":[34,56,76],
      "add":["Ktm","Bkt","Lal"]})
                  
df2=pd.DataFrame({"name":["Ram","Shaym","Hari"],
     "age":[34,56,76],
      "add":["Ktm","Bkt","Lal"]})

df=pd.concat([df1,df2]).reset_index()
df

   index   name  age  add
0      0    Ram   34  Ktm
1      1  Shaym   56  Bkt
2      2   Hari   76  Lal
3      0    Ram   34  Ktm
4      1  Shaym   56  Bkt
5      2   Hari   76  Lal

In [34]:
import pandas as pd

data={"name":["Ram","Shaym","Hari"],
     "age":[34,56,76],
      "add":["Ktm","Bkt","Lal"]}
df1=pd.DataFrame(data)
                  
df2=pd.DataFrame(data)

df=pd.concat([df1,df2]).reset_index()
df.to_json("concat_data.json")
df

   index   name  age  add
0      0    Ram   34  Ktm
1      1  Shaym   56  Bkt
2      2   Hari   76  Lal
3      0    Ram   34  Ktm
4      1  Shaym   56  Bkt
5      2   Hari   76  Lal